package main

import "fmt"

func main() {
	//外层循环的控制，用于控制最外层的行数
	for i := 1; i <= 9; i++ {
		//内层循环，用于控制列
		for j := 1; j <= i; j++ { //通过2d可以控制输出的格式，否则会有一点排版的问题
			fmt.Printf("%d*%d=%2d ", j, i, j*i)
		}
		//每完成一行，输出一次回车，这样就可以一行结束后，就可以回车继续第二行的输入
		fmt.Println()

	}

}

/* 结果
[Running] go run "d:\go_obj\day01\multiplication.go"
1*1= 1
1*2= 2 2*2= 4
1*3= 3 2*3= 6 3*3= 9
1*4= 4 2*4= 8 3*4=12 4*4=16
1*5= 5 2*5=10 3*5=15 4*5=20 5*5=25
1*6= 6 2*6=12 3*6=18 4*6=24 5*6=30 6*6=36
1*7= 7 2*7=14 3*7=21 4*7=28 5*7=35 6*7=42 7*7=49
1*8= 8 2*8=16 3*8=24 4*8=32 5*8=40 6*8=48 7*8=56 8*8=64
1*9= 9 2*9=18 3*9=27 4*9=36 5*9=45 6*9=54 7*9=63 8*9=72 9*9=81

[Done] exited with code=0 in 5.691 seconds
*/
