package main

/*
	create-date:2021-03-21
	describe: 使用冒泡排序，从小到大进行排序
	author:GO4035-huangxin
*/

import "fmt"

func main() {
	/*
			找到切片中最大的元素索引和值(打印)
		    	[]int{9, 8, 19, 10, 2, 8}
			使用 冒泡排序
			第一轮：
			9 -> 8 		比较 8 9 19 10 2 8
			9 -> 19 	比较 8 9 19 10 2 8
			19 -> 10	比较 8 9 10 19 2 8
			19 -> 2		比较 8 9 10 2 19 8
			19 -> 8		比较 8 9 10 2 8 19
			第二轮：
			8 -> 9		比较 8 9 10 2 8 19
			9 -> 10		比较 8 9 10 2 8 19
			10 -> 2		比较 8 9 2 10 8 19
			10 -> 8		比较 8 9 2 8 10 19
			第三轮：
			8 -> 9		比较 8 9 2 8 10 19
			9 -> 2		比较 8 2 9 8 10 19
			9 -> 8		比较 8 2 8 9 10 19
			第四轮：
			8 -> 2		比较 2 8 8 9 10 19
			8 -> 8 		比较 2 8 8 9 10 19
	*/
	// 定义 源nums
	nums := []int{9, 8, 19, 10, 2, 8}

	// 打印 源nums
	fmt.Println("排序前:", nums)

	// 使用 冒泡排序
	for i := 0; i < len(nums)-1; i++ {
		for j := 0; j < len(nums)-1-i; j++ {
			if nums[j] > nums[j+1] {
				nums[j], nums[j+1] = nums[j+1], nums[j]
			}
		}
	}
	// 打印排序后 nums
	fmt.Println("排序后:", nums)
}
